import React, { useEffect, useState } from "react";
import "../assets/styles/Main.css";
import LeftBar from "./LeftBar";
import MainPart from "./MainPart";

const chats_server = [
  {
    chatname: "chat1",
    iconUrl: "https://cdn-icons-png.flaticon.com/512/53/53125.png",
    id: 0,

    messages: [
      {
        message: "1111",
        time: "03:11 pm",
        isFrom: true,
      },
      {
        message: "gfsgsfagfsgsfafsagsfgsfgsfgsfgfsgfs",
        time: "03:11 pm",
        isFrom: false,
      },
      {
        message: "fdfadaddasgffdas",
        time: "03:12 am",
        isFrom: true,
      },
      {
        message: "fdfadaddasgffdas",
        time: "03:11 pm",
        isFrom: false,
      },
      {
        message:
          "2113243gfsjkgfduhbfsguphавввввввввввваааааааааааааааааааааааавввввввввввввввввввввввввваааааааааааааааааааааааавввввввввввввввввввввввввввввввввввввввввввввввввввввввааааааааааааааааааааааааввввввввввввввввввввввввввввввввввввввввввввввввввввввваааааааааааааааааааааааавввввввввввввввввввввввввввввввввввввввввввввввввввввввааааааааааааааааааааааааввввввввввввввввввввввввввввввввввввввввввввввввввввввввввввввввввввввввввввввввввввввввввввввввввввввввввввааааааааааааааааааааааааввввввввввввввввввввввввввввввввввввввввввввввввввввввваааааааааааааааааааааааавввввввввввввввввввввввввввввввввввввввввввввввввввввввааааааааааааааааааааааааввввввввввввввввввввввввввввввввввввввввввввввввввввввввввввввввввввввввввввввввввааааааааааааааааааааааааввввввввввввввввввввввввввввввввввввввввввввввввввввввваааааааааааааааааааааааавввввввввввввввввввввввввввввввввввввввввввввввввввввввввввввввввввввввааааааааааааааааааааааааввввввввввввввввввввввввввввввввввааааааааааааааааааааааааввввввввввввввввввввввввввввввввввввввввввввввввввввввваааааааааааааааааааааааавввввввввввввввввввввввввввввввввввввввввввввввввввввввааааааааааааааааааааааааввввввввввввввввввввввввввввввввввввввввввввввввввввввваааааааааааааааааааааааавввввввввввввввввввввввввввввввввввввввввввввввввввввыыыыыыыыыыыыыыввввввввввввввai",
        time: "03:21 pm",
        isFrom: false,
      },
      {
        message: "gfsgsfagfsgsfafsagsfgsfgsfgsfgfsgfs",
        time: "03:11 pm",
        isFrom: false,
      },
      {
        message: "fdfadaddasgffdas",
        time: "03:12 am",
        isFrom: true,
      },
      {
        message: "fdfadaddasgffdas",
        time: "03:11 pm",
        isFrom: false,
      },
      {
        message:
          "2113243gfsjkgfduhbfsguphавввввввввввваааааааааааааааааааааааавввввввввввввввввввввввввваааааааааааааааааааааааавввввввввввввввввввввввввввввввввввввввввввввввввввввввааааааааааааааааааааааааввввввввввввввввввввввввввввввввввввввввввввввввввввввваааааааааааааааааааааааавввввввввввввввввввввввввввввввввввввввввввввввввввввввааааааааааааааааааааааааввввввввввввввввввввввввввввввввввввввввввввввввввввввввввввввввввввввввввввввввввввввввввввввввввввввввввввааааааааааааааааааааааааввввввввввввввввввввввввввввввввввввввввввввввввввввввваааааааааааааааааааааааавввввввввввввввввввввввввввввввввввввввввввввввввввввввааааааааааааааааааааааааввввввввввввввввввввввввввввввввввввввввввввввввввввввввввввввввввввввввввввввввввааааааааааааааааааааааааввввввввввввввввввввввввввввввввввввввввввввввввввввввваааааааааааааааааааааааавввввввввввввввввввввввввввввввввввввввввввввввввввввввввввввввввввввввааааааааааааааааааааааааввввввввввввввввввввввввввввввввввааааааааааааааааааааааааввввввввввввввввввввввввввввввввввввввввввввввввввввввваааааааааааааааааааааааавввввввввввввввввввввввввввввввввввввввввввввввввввввввааааааааааааааааааааааааввввввввввввввввввввввввввввввввввввввввввввввввввввввваааааааааааааааааааааааавввввввввввввввввввввввввввввввввввввввввввввввввввввыыыыыыыыыыыыыыввввввввввввввai",
        time: "03:21 pm",
        isFrom: false,
      },
    ],
  },
  {
    chatname: "chat2",
    iconUrl: "https://cdn-icons-png.flaticon.com/512/8090/8090452.png",
    id: 1,

    messages: [
      {
        message: "fdfadaddasgffdas",
        time: "03:11 pm",
        isFrom: true,
      },
      {
        message: "gfsgsfagfsgsfafsagsfgsfgsfgsfgfsgfs",
        time: "03:11 pm",
        isFrom: false,
      },
      {
        message: "fdfadaddasgffdas",
        time: "03:12 am",
        isFrom: true,
      },
      {
        message: "fdfadaddasgffdas",
        time: "03:11 pm",
        isFrom: false,
      },
      {
        message:
          "2113243gfsjkgfduhbfsguphавввввввввввваааааааааааааааааааааааавввввввввввввввввввввввввваааааааааааааааааааааааавввввввввввввввввввввввввввввввввввввввввввввввввввввввааааааааааааааааааааааааввввввввввввввввввввввввввввввввввввввввввввввввввввввваааааааааааааааааааааааавввввввввввввввввввввввввввввввввввввввввввввввввввввввааааааааааааааааааааааааввввввввввввввввввввввввввввввввввввввввввввввввввввввввввввввввввввввввввввввввввввввввввввввввввввввввввввааааааааааааааааааааааааввввввввввввввввввввввввввввввввввввввввввввввввввввввваааааааааааааааааааааааавввввввввввввввввввввввввввввввввввввввввввввввввввввввааааааааааааааааааааааааввввввввввввввввввввввввввввввввввввввввввввввввввввввввввввввввввввввввввввввввввааааааааааааааааааааааааввввввввввввввввввввввввввввввввввввввввввввввввввввввваааааааааааааааааааааааавввввввввввввввввввввввввввввввввввввввввввввввввввввввввввввввввввввввааааааааааааааааааааааааввввввввввввввввввввввввввввввввввааааааааааааааааааааааааввввввввввввввввввввввввввввввввввввввввввввввввввввввваааааааааааааааааааааааавввввввввввввввввввввввввввввввввввввввввввввввввввввввааааааааааааааааааааааааввввввввввввввввввввввввввввввввввввввввввввввввввввввваааааааааааааааааааааааавввввввввввввввввввввввввввввввввввввввввввввввввввввыыыыыыыыыыыыыыввввввввввввввai",
        time: "03:21 pm",
        isFrom: false,
      },
      {
        message: "gfsgsfagfsgsfafsagsfgsfgsfgsfgfsgfs",
        time: "03:11 pm",
        isFrom: false,
      },
      {
        message: "fdfadaddasgffdas",
        time: "03:12 am",
        isFrom: true,
      },
      {
        message: "fdfadaddasgffdas",
        time: "03:11 pm",
        isFrom: false,
      },
      {
        message:
          "2113243gfsjkgfduhbfsguphавввввввввввваааааааааааааааааааааааавввввввввввввввввввввввввваааааааааааааааааааааааавввввввввввввввввввввввввввввввввввввввввввввввввввввввааааааааааааааааааааааааввввввввввввввввввввввввввввввввввввввввввввввввввввввваааааааааааааааааааааааавввввввввввввввввввввввввввввввввввввввввввввввввввввввааааааааааааааааааааааааввввввввввввввввввввввввввввввввввввввввввввввввввввввввввввввввввввввввввввввввввввввввввввввввввввввввввввааааааааааааааааааааааааввввввввввввввввввввввввввввввввввввввввввввввввввввввваааааааааааааааааааааааавввввввввввввввввввввввввввввввввввввввввввввввввввввввааааааааааааааааааааааааввввввввввввввввввввввввввввввввввввввввввввввввввввввввввввввввввввввввввввввввввааааааааааааааааааааааааввввввввввввввввввввввввввввввввввввввввввввввввввввввваааааааааааааааааааааааавввввввввввввввввввввввввввввввввввввввввввввввввввввввввввввввввввввввааааааааааааааааааааааааввввввввввввввввввввввввввввввввввааааааааааааааааааааааааввввввввввввввввввввввввввввввввввввввввввввввввввввввваааааааааааааааааааааааавввввввввввввввввввввввввввввввввввввввввввввввввввввввааааааааааааааааааааааааввввввввввввввввввввввввввввввввввввввввввввввввввввввваааааааааааааааааааааааавввввввввввввввввввввввввввввввввввввввввввввввввввввыыыыыыыыыыыыыыввввввввввввввai",
        time: "03:21 pm",
        isFrom: false,
      },
    ],
  },
];

const Main = ({ id, setIsLoginned }) => {
  const [chats, setChats] = useState([]);

  const [messages, setMessages] = useState([]);

  const [chatId, setChatId] = useState();
  
  const [isLeftBarHidden, setIsLeftBarHidden] = useState(false);

  useEffect(() => {
    if (chats.length > 0 && chatId >= 0 && chatId < chats.length) {
      setMessages(chats[chatId].messages);
      console.log(chatId);
      console.log(messages);
    } else {
      setMessages([]);
    }
  }, [chatId]);

  useEffect(() => {
    setChats(chats_server);

    setChatId(0);
    // console.log(chats_server);
  }, [id]);

  useEffect(() => {
    if (chats.length > 0 && chatId >= 0 && chatId < chats.length) {
      const updatedChats = chats.map((chat, index) =>
        index === chatId ? { ...chat, messages: messages } : chat
      );
      setChats(updatedChats);
    }
  }, [messages]);

  return (
    <div className="main">
      <LeftBar
        setChatId={setChatId}
        chats={chats}
        chatId={chatId}
        setIsLoginned={setIsLoginned}
        hook={[isLeftBarHidden, setIsLeftBarHidden]}
      />
      <MainPart
        messages={messages}
        setMessages={setMessages}
        chatname={chats.length > 0 ? chats[chatId].chatname : ""}
        setIsLeftBarHidden={setIsLeftBarHidden}
      />
    </div>
  );
};

export default Main;
